In [ ]:
# Importação de bibliotecas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
import plotly.figure_factory as ff
import warnings
warnings.filterwarnings('ignore')

In [19]:
#Leitura da base

df = pd.read_excel('data/Analise_Performance_Estudantes_modificado 1.xlsx')

display(df.head()) #Nao precisamos nenhum outro parametro

print('-----------------------------------------------')

display(df.tail())

print('-----------------------------------------------')

df.info()

,genero,grupo_etnico,nivel_escolaridade_dos_pais,almoco,curso_preparatorio_para_teste,nota_matematica,nota_leitura,nota_escrita
0,feminino,grupo_B,bacharelado,padrao,nenhum,72,72,74
1,feminino,grupo_C,algum curso superior,padrao,completo,69,90,88
2,feminino,grupo_B,mestrado,padrao,nenhum,90,95,93
3,masculino,grupo_A,curso tecnológico,lanche,nenhum,47,57,44
4,masculino,grupo_C,algum curso superior,padrao,nenhum,76,78,75

-----------------------------------------------

,genero,grupo_etnico,nivel_escolaridade_dos_pais,almoco,curso_preparatorio_para_teste,nota_matematica,nota_leitura,nota_escrita
4995,masculino,grupo_D,algum curso tecnico,lanche,nenhum,67,67,55
4996,feminino,grupo_B,algum curso tecnico,lanche,nenhum,67,61,56
4997,feminino,grupo_C,curso tecnológico,lanche,completo,51,63,55
4998,masculino,grupo_E,bacharelado,padrao,nenhum,60,46,55
4999,feminino,grupo_C,bacharelado,lanche,nenhum,78,82,87

-----------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 8 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   genero                         5000 non-null   object
 1   grupo_etnico                   5000 non-null   object
 2   nivel_escolaridade_dos_pais    5000 non-null   object
 3   almoco                         5000 non-null   object
 4   curso_preparatorio_para_teste  5000 non-null   object
 5   nota_matematica                5000 non-null   int64
 6   nota_leitura                   5000 non-null   int64
 7   nota_escrita                   5000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 312.6+ KB

In [20]:
#Mudança de nome das colunas
df = df.rename(columns={
    'gender': 'genero',
    'race/ethnicity': 'grupo_etnico',
    'parental level of education': 'nivel_escolaridade_dos_pais',
    'lunch': 'almoco',
    'test preparation course': 'curso_preparatorio_para_teste',
    'math score': 'nota_matematica',
    'reading score': 'nota_leitura',
    'writing score': 'nota_escrita'    
})
display(df.head())

,genero,grupo_etnico,nivel_escolaridade_dos_pais,almoco,curso_preparatorio_para_teste,nota_matematica,nota_leitura,nota_escrita
0,feminino,grupo_B,bacharelado,padrao,nenhum,72,72,74
1,feminino,grupo_C,algum curso superior,padrao,completo,69,90,88
2,feminino,grupo_B,mestrado,padrao,nenhum,90,95,93
3,masculino,grupo_A,curso tecnológico,lanche,nenhum,47,57,44
4,masculino,grupo_C,algum curso superior,padrao,nenhum,76,78,75

In [21]:
#Tratamento de dados

for column in df.columns: 
    print(f'Valores unicos na coluna {column}: ')
    if df[column].dtype == 'object':
        print(df[column].unique())
    else: 
        print(df[column].nunique())
    print('-' * 30)

Valores unicos na coluna genero:
['feminino' 'masculino']
------------------------------
Valores unicos na coluna grupo_etnico:
['grupo_B' 'grupo_C' 'grupo_A' 'grupo_D' 'grupo_E']
------------------------------
Valores unicos na coluna nivel_escolaridade_dos_pais:
['bacharelado' 'algum curso superior' 'mestrado' 'curso tecnológico'
 'ensino médio' 'algum curso tecnico']
------------------------------
Valores unicos na coluna almoco:
['padrao' 'lanche']
------------------------------
Valores unicos na coluna curso_preparatorio_para_teste:
['nenhum' 'completo']
------------------------------
Valores unicos na coluna nota_matematica:
87
------------------------------
Valores unicos na coluna nota_leitura:
82
------------------------------
Valores unicos na coluna nota_escrita:
86
------------------------------